RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_pdm.c
    base->VAD0_NCONFIG =
        (PDM_VAD0_NCONFIG_VADNFILAUTO((uint32_t)(config->enableAutoNoiseFilter ? 1UL : 0UL)) |
         PDM_VAD0_NCONFIG_VADNOREN((uint32_t)(config->enableNoiseDetectOR ? 1UL : 0UL)) |
         PDM_VAD0_NCONFIG_VADNMINEN((uint32_t)(config->enableNoiseMin ? 1UL : 0UL)) |
         PDM_VAD0_NCONFIG_VADNDECEN((uint32_t)(config->enableNoiseDecimation ? 1UL : 0UL)) |
         PDM_VAD0_NCONFIG_VADNFILADJ(config->noiseFilterAdjustment) |
         PDM_VAD0_NCONFIG_VADNGAIN(config->noiseGain));
}

/*!
 * brief Configure voice activity detector zero cross detector.
 *
 * param base PDM base pointer
 * param config Voice activity detector zero cross detector configure structure pointer .
 */
void PDM_SetHwvadZeroCrossDetectorConfig(PDM_Type *base, const pdm_hwvad_zero_cross_detector_t *config)
{
    assert(config != NULL);

    uint32_t zcd = (base->VAD0_ZCD & (~(PDM_VAD0_ZCD_VADZCDTH_MASK | PDM_VAD0_ZCD_VADZCDADJ_MASK |
                                        PDM_VAD0_ZCD_VADZCDAUTO_MASK | PDM_VAD0_ZCD_VADZCDAND_MASK)));

    zcd |= (PDM_VAD0_ZCD_VADZCDTH(config->threshold) |
            PDM_VAD0_ZCD_VADZCDADJ(config->adjustmentThreshold) |
            PDM_VAD0_ZCD_VADZCDAUTO((uint32_t)(config->enableAutoThreshold ? 1UL : 0UL)) |
            PDM_VAD0_ZCD_VADZCDAND(config->zcdAnd)) |
           PDM_VAD0_ZCD_VADZCDEN_MASK;

    base->VAD0_ZCD = zcd;
}

/*!
 * brief   Enable/Disable  hwvad callback.

 * This function enable/disable the hwvad interrupt for the selected PDM peripheral.
 *
 * param base Base address of the PDM peripheral.
 * param vadCallback callback Pointer to store callback function, should be NULL when disable.
 * param userData user data.
 * param enable true is enable, false is disable.
 * retval None.
 */
void PDM_EnableHwvadInterruptCallback(PDM_Type *base, pdm_hwvad_callback_t vadCallback, void *userData, bool enable)
{
    uint32_t instance = PDM_GetInstance(base);

    if (enable)
    {
        PDM_EnableHwvadInterrupts(base, (uint32_t)kPDM_HwvadErrorInterruptEnable | (uint32_t)kPDM_HwvadInterruptEnable);
        NVIC_ClearPendingIRQ(PDM_HWVAD_EVENT_IRQn);
        (void)EnableIRQ(PDM_HWVAD_EVENT_IRQn);
#if !(defined FSL_FEATURE_PDM_HAS_NO_INDEPENDENT_ERROR_IRQ && FSL_FEATURE_PDM_HAS_NO_INDEPENDENT_ERROR_IRQ)
        NVIC_ClearPendingIRQ(PDM_HWVAD_ERROR_IRQn);
        (void)EnableIRQ(PDM_HWVAD_ERROR_IRQn);
#endif
        s_pdm_hwvad_notification[instance].callback = vadCallback;
        s_pdm_hwvad_notification[instance].userData = userData;
    }
    else
    {
        PDM_DisableHwvadInterrupts(base,
                                   (uint32_t)kPDM_HwvadErrorInterruptEnable | (uint32_t)kPDM_HwvadInterruptEnable);
        (void)DisableIRQ(PDM_HWVAD_EVENT_IRQn);
#if !(defined FSL_FEATURE_PDM_HAS_NO_INDEPENDENT_ERROR_IRQ && FSL_FEATURE_PDM_HAS_NO_INDEPENDENT_ERROR_IRQ)
        (void)DisableIRQ(PDM_HWVAD_ERROR_IRQn);
        NVIC_ClearPendingIRQ(PDM_HWVAD_ERROR_IRQn);
#endif
        s_pdm_hwvad_notification[instance].callback = NULL;
        s_pdm_hwvad_notification[instance].userData = NULL;
        NVIC_ClearPendingIRQ(PDM_HWVAD_EVENT_IRQn);
    }
}

#if (defined PDM)
void PDM_HWVAD_EVENT_DriverIRQHandler(void);
void PDM_HWVAD_EVENT_DriverIRQHandler(void)
{
    if ((PDM_GetHwvadInterruptStatusFlags(PDM) & (uint32_t)kPDM_HwvadStatusVoiceDetectFlag) != 0U)
    {
        PDM_ClearHwvadInterruptStatusFlags(PDM, (uint32_t)kPDM_HwvadStatusVoiceDetectFlag);
        if (s_pdm_hwvad_notification[0].callback != NULL)
        {
            s_pdm_hwvad_notification[0].callback(kStatus_PDM_HWVAD_VoiceDetected, s_pdm_hwvad_notification[0].userData);
        }
    }
#if (defined FSL_FEATURE_PDM_HAS_NO_INDEPENDENT_ERROR_IRQ && FSL_FEATURE_PDM_HAS_NO_INDEPENDENT_ERROR_IRQ)
    else
    {
        PDM_ClearHwvadInterruptStatusFlags(PDM, (uint32_t)kPDM_HwvadStatusInputSaturation);
        if (s_pdm_hwvad_notification[0].callback != NULL)
        {
            s_pdm_hwvad_notification[0].callback(kStatus_PDM_HWVAD_Error, s_pdm_hwvad_notification[0].userData);
        }
    }
#endif
    SDK_ISR_EXIT_BARRIER;
}

#if !(defined FSL_FEATURE_PDM_HAS_NO_INDEPENDENT_ERROR_IRQ && FSL_FEATURE_PDM_HAS_NO_INDEPENDENT_ERROR_IRQ)
void PDM_HWVAD_ERROR_DriverIRQHandler(void);
void PDM_HWVAD_ERROR_DriverIRQHandler(void)
{
    PDM_ClearHwvadInterruptStatusFlags(PDM, (uint32_t)kPDM_HwvadStatusInputSaturation);
    if (s_pdm_hwvad_notification[0].callback != NULL)
    {
        s_pdm_hwvad_notification[0].callback(kStatus_PDM_HWVAD_Error, s_pdm_hwvad_notification[0].userData);
    }
    SDK_ISR_EXIT_BARRIER;
}
#endif
#endif
#endif

#if defined(PDM)
void PDM_EVENT_DriverIRQHandler(void);
void PDM_EVENT_DriverIRQHandler(void)
{
    assert(s_pdmHandle[0] != NULL);
    s_pdmIsr(PDM, s_pdmHandle[0]);
    SDK_ISR_EXIT_BARRIER;
}
#endif
